tap "beeftornado/rmtree"
tap "heroku/brew"
# brew "macvim", args: ["with-lua", "with-override-system-vim", "with-python3"]
brew "imagemagick"
brew "nvm"
# brew "postgresql@9.5", restart_service: true
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "heroku/brew/heroku"
brew "ripgrep"
brew "tmux"
brew "reattach-to-user-namespace"
brew "yarn"
brew "zsh"
brew "ctags"
brew "curl"
brew "hub"
brew "ncurses"
brew "tig"
brew "tmuxinator"
brew "v8"
# QMK compilation
# brew "osx-cross/avr/avr-gcc"

# Tools
brew "htop"
brew "mas"
brew "nmap"
brew "wget"

# Window management
# tap "crisidev/chunkwm"
tap "koekeishiya/formulae"
# brew "crisidev/chunkwm/chunkwm"
brew "koekeishiya/formulae/skhd"

# Mopidy with spotify
# tap "mopidy/mopidy"
# brew "mopidy/mopidy/libspotify"
# brew "mopidy/mopidy/mopidy"
# brew "mopidy/mopidy/mopidy-spotify"
# brew "mpc"

# Applications
tap "caskroom/cask"
# cask "airflow"
# cask "android-file-transfer"
# cask "bitbar"
# cask "dash"
# cask "dropbox"
# cask "evernote"
# cask "gfxcardstatus"
cask "insomnia"
cask "kitty"
# cask "libreoffice"
# cask "megasync"
cask "muzzle"
cask "skype"
# cask "station"
# cask "steam"
cask "stremio"
cask "telegram"
cask "the-unarchiver"
cask "transmission"
# cask "whatsapp"
# cask "fluid"
cask "rectangle"
cask "alfred"
cask "psequel"
cask "notion"
# cask "slack"
cask "visual-studio-code"
cask "discord"
cask "karabiner-elements"
cask "ngrok"
cask "stats"

# USB Tethering
# cask "horndis"
# cask "android-ndk"
# cask "android-sdk"
# cask "caskroom/fonts/font-fira-code"
# cask "caskroom/versions/iterm2-beta"
# cask "caskroom/versions/java8"
# cask "docker"
# cask "franz"
# cask "keyboard-maestro"
# cask "kitematic"
# cask "qupzilla"
# cask "qutebrowser"

# App Store
# mas "Keynote", id: 409183694
# mas "Kindle", id: 405399194
# mas "LastPass", id: 926036361
# mas "Noizio", id: 928871589
# mas "Pages", id: 409201541
# mas "Skitch", id: 425955336
mas "Xcode", id: 497799835
